home-configs/anderson/emacs/configuracao.org
# -*- mode: org; coding: utf-8-unix; fill-column: 80 -*-

#+title: Configuração do Emacs

Este arquivo conterá minha modesta configuração, devidamente documentada, do
Emacs.

Para desenovelá-la (/untangle/ no original saxão), use =M-x org-babel-tangle=
(ou =C-c C-v t=).

* Early Init

Desde a versão 27.1, o Emacs separa a inicialização em dois
estágios. [fn:lnk-EarlyInitFile] Antes da inicialização do sistema de pacotes e
da interface gráfica, o Emacs carrega o arquivo =early-init.el=.

** Header

Porque isso precisa gerar um arquivo bonito.

#+begin_src emacs-lisp :tangle ./early-init.el
  ;;; early-init.el --- Emacs early init file -*- lexical-binding: t; no-byte-compile: nil -*-

  ;;; Commentary:
  ;;; Arquivo de Inicialização Prévia do Emacs
  ;;;

  ;;; Code:

#+end_src

** Early Init - Tempo Inicial

Aqui registramos o momento inicial que o =early-init.el= foi carregado.

#+begin_src emacs-lisp :tangle ./early-init.el
  (defconst atorres-1985|early-init-start-time (current-time)
    "Early init start time.")
#+end_src

** Gerenciador de Pacotes

Os pacotes são instalados via Nix+Nixpkgs [fn:lnk-nixpkgs], então é interessante
impedir que o Emacs tente gerenciá-los.

#+begin_src emacs-lisp :tangle ./early-init.el
  (setopt package-archives nil
          package-enable-at-startup nil)
#+end_src

** GUI

#+begin_src emacs-lisp :tangle ./early-init.el
  (mapc (lambda (mode)
          (when (fboundp mode)
            (apply mode '(-1))))
        '(menu-bar-mode
          scroll-bar-mode
          tool-bar-mode))

  (setopt frame-inhibit-implied-resize t
          frame-resize-pixelwise t)

  (advice-add #'x-apply-session-resources :override #'ignore)

  ;; Removing the white flash
  (when (display-graphic-p)
    (set-face-background 'default "#282a36" nil)
    (set-face-foreground 'default "#f8f8f2" nil))
#+end_src

** Emacs Debug

Se a variável =EMACS_DEBUG= for setada, então ela habilita a depuração já na
inicialização e também quando ocorrer um erro.

#+begin_src emacs-lisp :tangle ./early-init.el
  (when (getenv-internal "EMACS_DEBUG")
    (setopt debug-on-error t)
    (setq-default init-file-debug t))
#+end_src

** Mini Otimizações

Essa mini otimização faz o Emacs carregar o =file-name-handler-alist= apenas
depois de realmente ter iniciado.

#+begin_src emacs-lisp :tangle ./early-init.el
  (setq backup-file-name-handler-alist file-name-handler-alist
        file-name-handler-alist nil)
  (add-hook 'emacs-startup-hook
            (lambda ()
              (setq file-name-handler-alist backup-file-name-handler-alist)
              (makunbound 'backup-file-name-handler-alist)))
#+end_src

E essa atrasa o coletor de lixo do Emacs - o pacote =gcmh= cuida disso mais
tarde.

Eu costumava setar isso para =most-positive-fixnum=, mas isso me parece um tanto
desnecessário. 4GB (=#x100000000=) devem bastar.

#+begin_src emacs-lisp :tangle ./early-init.el
  (setopt gc-cons-threshold #x100000000
          gc-cons-percentage 0.9)
#+end_src

** Early Init - Tempo Final

Aqui registramos o momento em que o carregamento do =early-init.el= foi
encerrado.

#+begin_src emacs-lisp :tangle ./early-init.el
  (defconst atorres-1985|early-init-finish-time (current-time)
    "Early init finish time.")
#+end_src

** Footer

Porque isso precisa gerar um arquivo bonito.

#+begin_src emacs-lisp :tangle ./early-init.el
  (provide 'early-init)

  ;; Local Variables:
  ;; mode: emacs-lisp
  ;; coding: utf-8-unix
  ;; fill-column: 80
  ;; End:

  ;;; early-init.el ends here
#+end_src

* Init

O arquivo tradicional de configuração do Emacs é o =init.el=. [fn:lnk-InitFile]

** Header

Porque isso precisa gerar um arquivo bonito.

#+begin_src emacs-lisp :tangle ./init.el
  ;;; init.el --- Emacs init file -*- lexical-binding: t; no-byte-compile: nil -*-

  ;;; Commentary:
  ;;  Arquivo de inicialização do Emacs

  ;;; Code:
#+end_src

** Early Init - Tempo Inicial

Aqui registramos o momento inicial que o =init.el= foi carregado.

#+begin_src emacs-lisp :tangle ./init.el
  (defconst atorres-1985|init-start-time (current-time)
    "Init start time.")
#+end_src

** Framework

Estou testando vários frameworks até sossegar em algum. A bola da vez de hoje é
o Setup! [fn:lnk-setupel]

** Requerimentos Iniciais

=cl-lib= é uma biblioteca que implementa diversas funcionalidades presentes em
Common Lisp - lembre-se, estamos no Emacs e não no CLISP [fn:lnk-clisp] REPL :)

#+begin_src emacs-lisp :tangle ./init.el
  (require 'cl-lib)
  (require 'package)

  (package-initialize)

  (require 'setup)
#+end_src

** Variáveis de Ambiente e Constantes

#+begin_src emacs-lisp :tangle ./init.el
  (unless (getenv "EDITOR")
    (setenv "EDITOR" "emacsclient"))

  (unless (getenv "VISUAL")
    (setenv "VISUAL" "emacsclient"))

  (unless (getenv "PAGER")
    (setenv "PAGER" "cat"))

  (defconst home-directory (getenv "HOME")
    "Home directory.")

  (defconst user-emacs-directory-log (concat user-emacs-directory "log/")
    "Logs directory.")
#+end_src

** no-littering

O pacote =no-littering= [fn:lnk-no-littering] serve para coletar todos os
diversos tipos de arquivos que os demais pacotes do Emacs geram enquanto são
executados, em especial caches e configurações temporárias.

Em razão disso, ele deve ser chamado o mais cedo possível, dado que todos os
demais pacotes se beneficiarão dele.

#+begin_src emacs-lisp :tangle ./init.el
  (setup no-littering
    (setq
     no-littering-etc-directory (expand-file-name ".cache/emacs/etc/" home-directory)
     no-littering-var-directory (expand-file-name ".cache/emacs/var/" home-directory))
    (:require no-littering)
    (dolist (dir `(,no-littering-etc-directory
           ,no-littering-var-directory))
      (unless (file-exists-p dir)
    (make-directory dir t))))
#+end_src

