home-configs/anderson/emacs/init.el
;;; init.el --- Emacs init file -*- lexical-binding: t; no-byte-compile: nil -*-

;;; Commentary:
;;  Arquivo de inicialização do Emacs

;;; Code:

(defconst atorres-1985|init-start-time (current-time)
  "Init start time.")

(require 'cl-lib)
(require 'package)

(package-initialize)

(require 'setup)

(unless (getenv "EDITOR")
  (setenv "EDITOR" "emacsclient"))

(unless (getenv "VISUAL")
  (setenv "VISUAL" "emacsclient"))

(unless (getenv "PAGER")
  (setenv "PAGER" "cat"))

(defconst home-directory (getenv "HOME")
  "Home directory.")

(defconst user-emacs-directory-log (concat user-emacs-directory "log/")
  "Logs directory.")

(setup no-littering
  (setq
   no-littering-etc-directory (expand-file-name ".cache/emacs/etc/" home-directory)
   no-littering-var-directory (expand-file-name ".cache/emacs/var/" home-directory))
  (:require no-littering)
  (dolist (dir `(,no-littering-etc-directory
         ,no-littering-var-directory))
    (unless (file-exists-p dir)
  (make-directory dir t))))
