home-configs/anderson/emacs/configuracao.org
** Seção: Funções Utilitárias

Talvez elas mereçam virar um pacote pessoal - assim que eu aprender a fazer
pacotes no Emacs Lisp!

#+begin_src emacs-lisp :tangle ./init.el
  (defmacro atorres-1985|emit-backup-pair (extension directory)
    "Return a pair (regex . directory) suitable for use as `backup-directory-alist'.

  The car of this pair is `EXTENSION' in regexp form, and the cdr is a
  subdirectory of `DIRECTORY' named `EXTENSION'."

    `(cons (rx "." ,extension eol)
           (expand-file-name ,extension ,directory)))

  (defmacro atorres-1985|pretty-expanded-form (form)
    "Output pretty-printed expanded form of given `FORM'."
    `(progn
       (pp (macroexpand-1 ',form))
       nil))

  (defun atorres-1985|sort-words (reverse begin end)
    "Sort words in region alphabetically, in REVERSE if negative.

  Region is defined between BEGIN and END.

  Prefixed with negative \\[universal-argument], sorts in reverse.

  The variable `sort-fold-case' determines whether alphabetic case affects the
  sort order.

  See `sort-regexp-fields'."
    (interactive "*P\nr")
    (sort-regexp-fields reverse "\\w+" "\\&" begin end))

  (defun atorres-1985|sort-symbols (reverse begin end)
    "Sort symbols in region alphabetically, in REVERSE if negative.

  Region is defined between BEGIN and END.

  Prefixed with negative \\[universal-argument], sorts in reverse.

  The variable `sort-fold-case' determines whether alphabetic case affects the
  sort order.

  See `sort-regexp-fields'."
    (interactive "*P\nr")
    (sort-regexp-fields reverse "\\(\\sw\\|\\s_\\)+" "\\&" begin end))

  (defun atorres-1985|show-percentage ()
    "Calculate and display the percentage before and after the current point."
    (interactive)
    (let* ((frac (/ (* 1.0 (point)) (point-max)))
           (perc (* 100 frac))
           (rest (- 100 perc)))
      (message "atorres-1985|show-percentage: %d + %d = %d"
               perc rest (+ perc rest))))

  (defun atorres-1985|move-region (start end n)
    "Move the region bewteen START and END by N lines."
    (interactive "r\np")
    (let
        ((line-text (delete-and-extract-region start end)))
      (forward-line n)
      (let
          ((start (point)))
        (insert line-text)
        (setq deactivate-mark nil)
        (set-mark start))))

  (defun atorres-1985|move-region-up (start end n)
    "Move the region between START and END up by N lines."
    (interactive "r\np")
    (atorres-1985|move-region start end (if (null n) -1 (- n))))

  (defun atorres-1985|move-region-down (start end n)
    "Move the region between START and END down by N lines."
    (interactive "r\np")
    (atorres-1985|move-region start end (if (null n) 1 n)))

  (defun atorres-1985|toggle-fullscreen ()
    "Toggle fullscreen."
    (interactive)
    (set-frame-parameter nil 'fullscreen
                         (if (frame-parameter nil 'fullscreen)
                             nil
                           'fullboth)))

  (defun atorres-1985|find-init-file ()
    "Open Emacs init file."
    (interactive)
    (find-file user-init-file))

  (defun atorres-1985|load-directory (directory)
    "Load extra scripts scattered on DIRECTORY."
    (when (file-directory-p directory)
      (dolist (file (directory-files directory nil "el$"))
        (load-file (concat directory "/" file)))))

  (defun atorres-1985|add-to-list-after (list-var old new &optional compare-fn)
    "Add NEW after OLD in the ordered list LIST-VAR.

  OLD is compared with COMPARE-FN which defaults to `equal'.

  NEW is not added if it already exists after OLD, also according
  to COMPARE-FN, making this function idempotent."
    (let ((cmp (or compare-fn #'equal)))
      (cl-do ((x (symbol-value list-var) (cdr x)))
          ((null x))
        (when (and (funcall cmp (car x) old)
                   (not (funcall cmp (cadr x) new)))
          (setf (cdr x) (cons new (cdr x))))))
    (symbol-value list-var))

  (defun atorres-1985|buffer-file-or-directory-name (buf)
    "The file BUF is visiting; works if it's a `dired' buffer too."
    (with-current-buffer buf
      (or buffer-file-name
          (and (eq major-mode 'dired-mode)
               (boundp 'dired-directory)
               (file-name-directory
                (if (stringp dired-directory)
                    dired-directory
                  (car dired-directory)))))))

  (defmacro atorres-1985|with-face (string &rest face-properties)
    "A thin wrapper on propertize.

  Return a copy of STRING with FACE-PROPERTIES added."
    `(propertize ,string 'face (list ,@face-properties)))

  (defun atorres-1985|eshell-prompt ()
    "Custom eshell prompt."
    (let ((header-bg "#000"))
      (concat "\n"
              (atorres-1985|with-face (concat (eshell/pwd) " ")
                                      :background header-bg)
              (atorres-1985|with-face (format-time-string "(%Y-%m-%d %H:%M) "
                                                          (current-time))
                                      :background header-bg
                                      :foreground "#0000FF")
              (atorres-1985|with-face
               (or (ignore-errors
                     (format "(%s)"
                             (vc-responsible-backend default-directory)))
                   "")
               :background header-bg)
              (atorres-1985|with-face " "
                                      :background header-bg)
              (atorres-1985|with-face "|"
                                      :background "grey")
              (atorres-1985|with-face user-login-name
                                      :foreground "blue")
              "@"
              (atorres-1985|with-face "localhost"
                                      :foreground "green")
              (if (= (user-uid) 0)
                  (atorres-1985|with-face " #\n> "
                                          :foreground "red")
                (atorres-1985|with-face " $\n> "
                                        :foreground "green")))))

  (defun atorres-1985|string-make-clickable (string click-command &optional help-echo)
    "Create a clickable STRING according to \"33.19.8 Defining Clickable Text\".

  CLICK-COMMAND is what happens on click and HELP-ECHO or the
  documentation string of CLICK-COMMAND is the tooltip."
    (propertize
     string
     'mouse-face 'highlight
     'help-echo (concat "mouse-2: " (or help-echo
                                        (documentation click-command 'raw)))
     'keymap (let ((map (make-sparse-keymap)))
               (define-key map [mouse-2] click-command)
               (define-key map (kbd "RET") click-command)
               (define-key map [follow-link] 'mouse-face)
               map)))

  (defmacro atorres-1985|add-to-local-keymap (&rest definitions)
    "Add the DEFINITIONS to the current buffer's local keymap.

  The DEFINITIONS should be an alist of keys (arguments for `kbd')
  and commands.

  Probably shouldn't be chained too much, as it would create
  a deeply nested keymap inheritance structure."
    (let ((map (gensym)))
      `(let ((,map (make-sparse-keymap)))
         (set-keymap-parent ,map (current-local-map))
         ,@(mapcar
            (lambda (def)
              (list 'define-key map (kbd (car def)) `#',(cdr def)))
            definitions)
         (use-local-map ,map))))
#+end_src

** Seção Solta: C Hook

#+begin_src emacs-lisp :tangle no
  (defun atorres1985|c-hook ()
    "Hook for C."
    (setq-default indent-tabs-mode nil)
    (setq c-basic-offset 4
          c-indent-level 4
          c-default-style "bsd"))

  (add-hook 'c-mode-common-hook #'atorres1985|c-hook)
  (add-hook 'c-mode-common-hook #'smartparens-mode)
#+end_src

