home-configs/anderson/emacs/configuracao.org
** Seção: Backups

Uma das coisas mais importantes que já configurei no Emacs e me salvou umas
tantas vezes foi o sisteminha de backups!

#+begin_src emacs-lisp :tangle ./init.el
  (let*
      ((backup-directory
        (expand-file-name ".text-backups" home-directory))
       (c-pair (atorres-1985|emit-backup-pair "c" backup-directory))
       (el-pair (atorres-1985|emit-backup-pair "el" backup-directory))
       (md-pair (atorres-1985|emit-backup-pair "md" backup-directory))
       (nix-pair (atorres-1985|emit-backup-pair "nix" backup-directory))
       (org-pair (atorres-1985|emit-backup-pair "org" backup-directory))
       (py-pair (atorres-1985|emit-backup-pair "py" backup-directory))
       (sh-pair (atorres-1985|emit-backup-pair "sh" backup-directory))
       (tex-pair (atorres-1985|emit-backup-pair "tex" backup-directory))
       (txt-pair (atorres-1985|emit-backup-pair "txt" backup-directory))
       (adoc-pair (atorres-1985|emit-backup-pair "adoc" backup-directory)))
    (setq backup-directory-alist
          `(("." . ,backup-directory)))
    (dolist (l `(,txt-pair
                 ,tex-pair
                 ,sh-pair
                 ,py-pair
                 ,org-pair
                 ,nix-pair
                 ,md-pair
                 ,el-pair
                 ,c-pair
                 ,adoc-pair))
      (unless (file-exists-p (cdr l))
        (make-directory (cdr l) t))
      (cl-pushnew l backup-directory-alist)))
#+end_src

** server

O pacote =server= vem por padrão no Emacs.

Este trecho de código carrega o servidor apenas uma vez.

#+begin_src emacs-lisp :tangle ./init.el
  (setup server
    (:require server)
    (unless (server-running-p)
      (server-start)))
#+end_src

** files

Outro pacote já presente no Emacs.

#+begin_src emacs-lisp :tangle ./init.el
  (setup files
    (setopt auto-save-default t
            backup-by-copying t
            delete-old-versions t
            kept-new-versions 5
            kept-old-versions 5
            make-backup-files t
            version-control t))
#+end_src

** recentf

#+begin_src emacs-lisp :tangle ./init.el
  (setup recentf
    (setopt recentf-max-saved-items 50)
    (recentf-mode 1))
#+end_src

** simple

Outro pacote já presente no Emacs.

#+begin_src emacs-lisp :tangle ./init.el
  (setup simple
    (setq-default line-move-visual nil)
    (setopt column-number-mode 1
          save-interprogram-paste-before-kill t))
#+end_src

** mouse

Outro pacote já presente no Emacs.

#+begin_src emacs-lisp :tangle ./init.el
  (setup mouse
    (setq mouse-yank-at-point t))
#+end_src

** mule

[[https://savannah.nongnu.org/projects/mule][MULE]] é o sistema de multi-linguagem do Emacs. [fn:lnk-International]

#+begin_src emacs-lisp :tangle ./init.el
  (setup mule
    (prefer-coding-system 'utf-8)
    (set-default-coding-systems 'utf-8)
    (set-terminal-coding-system 'utf-8)
    (set-keyboard-coding-system 'utf-8))
#+end_src

** vc-hooks

#+begin_src emacs-lisp :tangle ./init.el
  (setup vc-hooks
    (setq-default vc-follow-symlinks t)
    (setq vc-make-backup-files t))
#+end_src

** savehist

#+begin_src emacs-lisp :tangle ./init.el
  (setup savehist
    (:require savehist)
    (setopt history-length 25)
    (savehist-mode +1))
#+end_src

** which-key

#+begin_src emacs-lisp :tangle ./init.el
  (setup which-key
    (:require which-key)
    (which-key-mode))
#+end_src

** beginend

O pacote beginend [fn:lnk-beginend] re-mapeia os comandos =M-<= e =M->= (ou, mais
precisamente, o que quer que esteja atuando como =beginning-of-buffer= e
=end-of-buffer=) para ir até os "extremos lógicos" do documento, em vez de ir
até os extremos físicos. Por exemplo, em um documento do LaTeX [fn:lnk-latex] os
extremos lógicos são marcados por =\begin{document}= e =\end{document}=.

Os extremos físicos ainda são acessíveis, basta repetir o comando!

#+begin_src emacs-lisp :tangle ./init.el
  (setup beginend
    (:require beginend)
    (beginend-global-mode))
#+end_src

** show-paren-mode

#+begin_src emacs-lisp :tangle ./init.el
  (setup paren
    (setopt show-paren-delay 0
            show-paren-style 'parenthesis)
    (show-paren-mode t))
#+end_src

** bs

#+begin_src emacs-lisp :tangle ./init.el
  (setup bs
    (:require bs)
    (setopt bs-max-window-height 36
            bs-minimal-buffer-name-column 25))
#+end_src

** pdf-tools

O pacote pdf-tools [fn:lnk-pdftools] é uma suite PDF para o Emacs que renderiza e
armazena os arquivos PDF na memória.

#+begin_src emacs-lisp :tangle ./init.el
  (setup pdf-tools
    (:require pdf-tools)
    (pdf-tools-install))
#+end_src

** text-mode

#+begin_src emacs-lisp :tangle ./init.el
  (setup text-mode
    (:with-hook text-mode
      (:hook turn-on-visual-line-mode
             turn-on-auto-fill)))
#+end_src

** Org Mode

#+begin_src emacs-lisp :tangle no
  (setup org
    (setq org-html-htmlize-font-prefix "org-#"
          org-html-htmlize-output-type 'inline-css
          org-highlight-latex-and-related '(latex script)
          org-link-descriptive nil)
    (add-hook 'org-mode-hook 'flyspell-mode))
#+end_src

** crux

O pacote =crux= [fn:lnk-crux] é uma coleção de extensões ridiculamente úteis.

#+begin_src emacs-lisp :tangle ./init.el
  (setup crux
    (:require crux))
#+end_src

** hungry-delete

#+begin_src emacs-lisp :tangle ./init.el
  (setup hungry-delete
    (:require hungry-delete)
    (global-hungry-delete-mode))
#+end_src

** hardcore-mode

O pacote hardcore-mode [fn:lnk-hardcore-mode] torna impossível usar as setas do
teclado. Por padrão ele também torna impossível usar Enter e Backspace, mas isso
pode (deve?) ser mudado com as variáveis =too-hardcore-backspace= e
=too-hardcore-return=.

#+begin_src emacs-lisp :tangle ./init.el
  (setup hardcore-mode
    (setopt too-hardcore-backspace t
            too-hardcore-return t)
    (:require hardcore-mode)
    (global-hardcore-mode))
#+end_src

** blackout

#+begin_src emacs-lisp :tabgle ./init.el
  (setup blackout)
#+end_src

** unfill

O pacote =unfill= [fn:lnk-unfill] provê comandos para "recolar" regiões, parágrafos
etc.

#+begin_src emacs-lisp :tangle ./init.el
  (setup unfill)
#+end_src

** display-fill-column-indicator

#+begin_src emacs-lisp :tangle ./init.el
  (setup display-fill-column-indicator
    (:require display-fill-column-indicator)
    (global-display-fill-column-indicator-mode))
#+end_src

** nhexl-mode

#+begin_src emacs-lisp :tangle ./init.el
  (setup nhexl-mode)
#+end_src

** helpful

#+begin_src emacs-lisp :tangle ./init.el
  (setup helpful)
#+end_src

** eshell

O pacote =eshell= é parte integrante do Emacs.

#+begin_src emacs-lisp :tangle ./init.el
  (setup eshell
    (:if-package eshell)
    (setopt eshell-prompt-function 'atorres1985|eshell-prompt
            eshell-highlight-prompt nil))
#+end_src

** eat

#+begin_src emacs-lisp :tangle ./init.el
  (setup eat
    (:if-package eat)
    (setopt eat-eshell-fallback-if-stty-not-available t))
#+end_src

** display-line-numbers

#+begin_src emacs-lisp :tangle ./init.el
  (setup display-line-numbers)
#+end_src

** dynamic-ruler

#+begin_src emacs-lisp :tangle ./init.el
  (setup dynamic-ruler)
#+end_src

** deadgrep

O =deadgrep= [fn:lnk-deadgrep] é uma interface para o programa =ripgrep=, que
(como o nome sugere - ao menos para quem conhece o =grep=) pesquisa strings em
textos.

#+begin_src emacs-lisp :tangle ./init.el
  (setup deadgrep
    (:and (executable-find "rg")
          (:require deadgrep))
    (defalias 'dgrep 'deadgrep
      "Custom alias for deadgrep."))
#+end_src

** dwim-shell-command

#+begin_src emacs-lisp :tangle ./init.el
  (setup dwim-shell-command
    (:require dwim-shell-command)
    (:also-load dwim-shell-commands))
#+end_src

** all-the-icons

O pacote =all-the-icons= [fn:lnk-all-the-icons] fornece ícones bonitinhos para
diversos recursos do Emacs, especialmente o Dired.

#+begin_src emacs-lisp :tangle ./init.el
  (setup all-the-icons
    (:and (display-graphic-p)
      (:require all-the-icons)))
#+end_src

