home-configs/anderson/emacs/init.el
      (expand-file-name ".text-backups" home-directory))
     (c-pair (atorres-1985|emit-backup-pair "c" backup-directory))
     (el-pair (atorres-1985|emit-backup-pair "el" backup-directory))
     (md-pair (atorres-1985|emit-backup-pair "md" backup-directory))
     (nix-pair (atorres-1985|emit-backup-pair "nix" backup-directory))
     (org-pair (atorres-1985|emit-backup-pair "org" backup-directory))
     (py-pair (atorres-1985|emit-backup-pair "py" backup-directory))
     (sh-pair (atorres-1985|emit-backup-pair "sh" backup-directory))
     (tex-pair (atorres-1985|emit-backup-pair "tex" backup-directory))
     (txt-pair (atorres-1985|emit-backup-pair "txt" backup-directory))
     (adoc-pair (atorres-1985|emit-backup-pair "adoc" backup-directory)))
  (setq backup-directory-alist
        `(("." . ,backup-directory)))
  (dolist (l `(,txt-pair
               ,tex-pair
               ,sh-pair
               ,py-pair
               ,org-pair
               ,nix-pair
               ,md-pair
               ,el-pair
               ,c-pair
               ,adoc-pair))
    (unless (file-exists-p (cdr l))
      (make-directory (cdr l) t))
    (cl-pushnew l backup-directory-alist)))

(setup server
  (:require server)
  (unless (server-running-p)
    (server-start)))

(setup files
  (setopt auto-save-default t
          backup-by-copying t
          delete-old-versions t
          kept-new-versions 5
          kept-old-versions 5
          make-backup-files t
          version-control t))

(setup recentf
  (setopt recentf-max-saved-items 50)
  (recentf-mode 1))

(setup simple
  (setq-default line-move-visual nil)
  (setopt column-number-mode 1
        save-interprogram-paste-before-kill t))

(setup mouse
  (setq mouse-yank-at-point t))

(setup mule
  (prefer-coding-system 'utf-8)
  (set-default-coding-systems 'utf-8)
  (set-terminal-coding-system 'utf-8)
  (set-keyboard-coding-system 'utf-8))

(setup vc-hooks
  (setq-default vc-follow-symlinks t)
  (setq vc-make-backup-files t))

(setup savehist
  (:require savehist)
  (setopt history-length 25)
  (savehist-mode +1))

(setup which-key
  (:require which-key)
  (which-key-mode))

(setup beginend
  (:require beginend)
  (beginend-global-mode))

(setup paren
  (setopt show-paren-delay 0
          show-paren-style 'parenthesis)
  (show-paren-mode t))

(setup bs
  (:require bs)
  (setopt bs-max-window-height 36
          bs-minimal-buffer-name-column 25))

(setup pdf-tools
  (:require pdf-tools)
  (pdf-tools-install))

(setup text-mode
  (:with-hook text-mode
    (:hook turn-on-visual-line-mode
           turn-on-auto-fill)))

(setup crux
  (:require crux))

(setup hungry-delete
  (:require hungry-delete)
  (global-hungry-delete-mode))

(setup hardcore-mode
  (setopt too-hardcore-backspace t
          too-hardcore-return t)
  (:require hardcore-mode)
  (global-hardcore-mode))

(setup unfill)

(setup display-fill-column-indicator
  (:require display-fill-column-indicator)
  (global-display-fill-column-indicator-mode))

(setup nhexl-mode)

(setup helpful)

(setup eshell
  (:if-package eshell)
  (setopt eshell-prompt-function 'atorres1985|eshell-prompt
          eshell-highlight-prompt nil))

(setup eat
  (:if-package eat)
  (setopt eat-eshell-fallback-if-stty-not-available t))

(setup display-line-numbers)

(setup dynamic-ruler)

(setup deadgrep
  (:and (executable-find "rg")
        (:require deadgrep))
  (defalias 'dgrep 'deadgrep
    "Custom alias for deadgrep."))

(setup dwim-shell-command
  (:require dwim-shell-command)
  (:also-load dwim-shell-commands))

(setup all-the-icons
  (:and (display-graphic-p)
    (:require all-the-icons)))

(setup (:require dired dired-x diredfl dirvish)
