home-configs/anderson/emacs/init.el
  (set-face-attribute 'diredfl-dir-name nil :bold t)
  (:with-hook (dired-mode-hook dirvish-directory-view-mode)
    (:hook diredfl-mode))

  (setopt dirvish-use-mode-line t
          dirvish-use-header-line 'global)

  (setopt dirvish-mode-line-format
          '(:left (sort symlink) :right (omit yank index)))

  (setopt dirvish-attributes
          '(all-the-icons
            collapse
            file-size
            file-time
            git-msg
            subtree-state
            vc-state))

  (setopt dirvish-quick-access-entries
          '(("h" "~/"                          "Home")
            ("d" "~/Downloads/"                "Downloads")
            ("p" "/run/media/"                 "Pendrives")
            ("s" "/mnt/source-codes"           "Sources")
            ("t" "~/.local/share/Trash/files/" "TrashCan")))

  (setopt dired-listing-switches
          (string-join '("-l"
                         "--all"
                         "--inode"
                         "--human-readable"
                         "--group-directories-first"
                         "--no-group")
                       " "))

  ;; dirvish previews
  (dirvish-define-preview eza (file)
    "Use `eza' to generate directory preview."
    :require ("eza")
    (when (file-directory-p file) ; we only interest in directories here
      `(shell . ("eza" "--all"
                 "--bytes"
                 "--color=always"
                 "--group"
                 "--group-directories-first"
                 "--header"
                 "--icons"
                 "--inode"
                 "--long"
                 "--octal-permissions"
                 "--oneline"
                 ,file))))
  (cl-pushnew 'eza dirvish-preview-dispatchers)

  (dirvish-define-preview elinks (file)
    "Use `elinks' to generate HTML preview."
    :require ("elinks")
    (when (string-match (rx (or ".htm" ".html") line-end) file)
      `(shell . ("elinks"
                 "-dump"
                 "-localhost"
                 "-no-numbering"
                 "-no-references"
                 "-default-mime-type" "text/html"
                 "-dump-width" "80"
                 ,file))))
  (cl-pushnew 'elinks dirvish-preview-dispatchers)

  (dirvish-side-follow-mode)
  (dirvish-override-dired-mode +1))

(setup page-break-lines
  (:require page-break-lines)
  (setopt page-break-lines-modes nil
          page-break-lines-max-width 80)

  (dolist (mode '(compilation-mode
                  dashboard-mode
                  emacs-lisp-mode
                  help-mode
                  lisp-mode
                  outline-mode
                  scheme-mode))
    (add-to-list 'page-break-lines-modes mode))
  (page-break-lines-mode))

(setup magit)

(setup dashboard
  (:require dashboard)
  (setopt dashboard-banner-logo-title "Welcome to the Emacs Dashboard!"
          dashboard-center-content nil
          dashboard-page-separator "\n\n"
          dashboard-set-file-icons nil
          dashboard-set-heading-icons nil
          dashboard-show-shortcuts t
          dashboard-items '()
          dashboard-startup-banner 'logo)

  (add-to-list 'dashboard-items '(agenda . 5))
  (add-to-list 'dashboard-items '(bookmarks . 5))
  (add-to-list 'dashboard-items '(projects . 5))
  ;; (add-to-list 'dashboard-items '(recents . 5))
  (add-to-list 'dashboard-items '(registers . 5))

  (dashboard-setup-startup-hook))

(when (display-graphic-p)
  (load-theme 'ef-bio t nil))

(set-face-attribute 'default nil
                    :height 225)

(set-face-attribute 'lazy-highlight nil
                    :foreground "black"
                    :background "green")

(setq initial-frame-alist (quote ((fullscreen . maximized))))
(cl-pushnew '(width . 120) default-frame-alist) ; characters
(cl-pushnew '(height . 36) default-frame-alist) ; lines

(setopt custom-file (expand-file-name "custom.el" user-emacs-directory))
(when (file-exists-p custom-file)
  (load custom-file nil t))

(let
    ((extra-lisp-dir (expand-file-name "extra-lisp.d" user-emacs-directory)))
  (when (file-accessible-directory-p extra-lisp-dir)
    (atorres1985|load-directory extra-lisp-dir)))

;; Don't pop up UI dialogs when prompting
(setopt use-dialog-box nil)

(global-set-key [remap dabbrev-expand] 'hippie-expand)
(global-unset-key (kbd "<insert>"))

(defalias 'yes-or-no-p 'y-or-n-p
  "An alias for y-or-n-p to write less.")

(setopt auto-save-interval 300
        auto-save-timeout 30
        delete-by-moving-to-trash nil
        inhibit-startup-screen t ; startup.el
        visible-bell t)

(setopt
 initial-scratch-message ; startup.el
 (mapconcat 'identity
            '(";;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;"
              ";;; This buffer is for notes you don't want to save, and to Emacs Lisp code. ;;;"
              ";;; If you want to create a file, visit it with `M-x find-file' (usually     ;;;"
              ";;; bounded to `C-x C-f'), then insert text in the file's own buffer.        ;;;"
              ";;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;")
            "\n"))

(setq-default fill-column 80
              frame-resize-pixelwise t
              indent-tabs-mode nil
              major-mode 'text-mode
              tab-width 4
              window-resize-pixelwise t
              word-wrap t)

(setq frame-title-format
      '(buffer-file-name
        "%b - %f"                        ; File buffer
        (dired-directory dired-directory ; Dired buffer
                         (revert-buffer-function
                          "%b"                                 ; Buffer Menu
                          ("%b - Dir: " default-directory))))) ; Plain buffer

(setq load-prefer-newer t)

(setup bs
  (:require bs)
