home-configs/anderson/emacs/configuracao.org
** Keybindings

O manual do Emacs tem uma seção dedicada a convenções de
keybindings [fn:lnk-KeyBindingConventions].

Minha intenção, no futuro, será coletar o código das keybindings em um canto só,
de tal maneira que seja possível ver todos de uma vez.

#+begin_src emacs-lisp :tangle ./init.el
  (setup bs
    (:require bs)
    (:global [remap list-buffers] bs-show))

  (setup display-line-numbers
    (:global (kbd "C-c l l") display-line-numbers-mode))

  (setup unfill
    (:global (kbd "C-c u p") unfill-paragraph)
    (:global (kbd "C-c u r") unfill-region)
    (:global (kbd "C-c u t") unfill-toggle))

  (setup helpful
    (:require helpful)
    (:global [remap describe-key] helpful-key)
    (:global [remap describe-function] helpful-callable)
    (:global [remap describe-command] helpful-command)
    (:global [remap describe-variable] helpful-variable)
    (:global (kbd "C-c h s") helpful-symbol)
    (:global (kbd "C-c h p") helpful-at-point))

  (setup dynamic-ruler
    (:if-package dynamic-ruler)
    ;; (:global (kbd "C-c r v") dynamic-ruler-vertical) ;; bugged!
    (:global (kbd "C-c r h") dynamic-ruler))

  (setup (:require dired dired-x diredfl dirvish)
    (:global (kbd "C-c d f") dirvish-fd)
    (:with-map dired-mode-map
      (defun atorres-1985|dired-find-file-other-frame ()
        "In Dired, visit this file or directory in another window."
        (interactive)
        (find-file-other-frame (dired-get-file-for-visit)))
      (:bind (kbd "F") #'atorres-1985|dired-find-file-other-frame))

    (:with-map dirvish-mode-map
      (:bind (kbd "a")   dirvish-quick-access)
      (:bind (kbd "f")   dirvish-file-info-menu)
      (:bind (kbd "y")   dirvish-yank-menu)
      (:bind (kbd "N")   dirvish-narrow)
      (:bind (kbd "^")   dirvish-history-last)
      (:bind (kbd "h")   dirvish-history-jump) ; remapped `describe-mode'
      (:bind (kbd "s")   dirvish-quicksort)    ; remapped `dired-sort-toggle-or-edit'
      ;; (:bind (kbd "v")   dirvish-vc-menu)   ; remapped `dired-view-file'
      (:bind "<tab>" dirvish-subtree-toggle) ;; kbd does not work!
      (:bind (kbd "M-f") dirvish-history-go-forward)
      (:bind (kbd "M-b") dirvish-history-go-backward)
      (:bind (kbd "M-l") dirvish-ls-switches-menu)
      (:bind (kbd "M-m") dirvish-mark-menu)
      (:bind (kbd "M-t") dirvish-layout-toggle)
      (:bind (kbd "M-s") dirvish-setup-menu)
      (:bind (kbd "M-e") dirvish-emerge-menu)
      (:bind (kbd "M-j") dirvish-fd-jump)))

  (setup magit
    (:if-package magit)
    (global-unset-key (kbd "C-x g"))
    (:global "C-c g s" magit-status))

  (setup dwim-shell-command
    (:if-package dwim-shell-command)
    (:global (kbd "C-c s !") dwim-shell-command))
#+end_src

** gcmh

O pacote =gcmh= [fn:lnk-gcmh] habilita um pequeno hack no coletor de lixo.

#+begin_src emacs-lisp :tangle ./init.el
  (setup gcmh
    (:require gcmh)
    (setopt gcmh-verbose nil)
    (gcmh-mode))
#+end_src

** Init - Tempo Final

Aqui registramos o momento em que o carregamento do =init.el= foi encerrado.

#+begin_src emacs-lisp :tangle ./init.el
  (defconst atorres-1985|init-finish-time (current-time)
    "Init finish time.")
#+end_src

E também uma tabela das diferenças de tempo!

#+begin_src emacs-lisp :tangle no
  (let*
      ((time-diff-early-init
        (time-subtract atorres-1985|early-init-finish-time
                       atorres-1985|early-init-start-time))
       (time-diff-init
        (time-subtract atorres-1985|init-finish-time
                       atorres-1985|init-start-time))
       (time-diff
        (time-subtract atorres-1985|init-finish-time
                       atorres-1985|early-init-start-time))
       (format-string "%Mmin %Ss.%3N")

       (str (concat
             "----------------------------------------\n"
             "Early init: " (format-time-string format-string time-diff-early-init) "\n"
             "Init: " (format-time-string format-string time-diff-init) "\n"
             "Full: " (format-time-string format-string time-diff) "\n"
             "----------------------------------------\n")))
    (message str))
#+end_src

** Footer

Porque isso precisa gerar um arquivo bonito.

#+begin_src emacs-lisp :tangle ./init.el
  (provide 'init)

  ;; Local Variables:
  ;; mode: emacs-lisp
  ;; coding: utf-8-unix
  ;; fill-column: 80
  ;; End:

  ;;; init.el ends here
#+end_src

* Comentários

* Referências

# - setopt vs setq

* Footnotes

[fn:lnk-diredfl] https://github.com/purcell/diredfl

[fn:lnk-all-the-icons]  https://github.com/domtronn/all-the-icons.el

[fn:lnk-clisp] https://clisp.sourceforge.io/

[fn:lnk-EarlyInitFile] https://www.gnu.org/software/emacs/manual/html_node/emacs/Early-Init-File.html

[fn:lnk-InitFile] https://www.gnu.org/software/emacs/manual/html_node/emacs/Init-File.html

[fn:lnk-International] https://www.gnu.org/software/emacs/manual/html_node/emacs/International.html#International

[fn:lnk-KeyBindingConventions] https://www.gnu.org/software/emacs/manual/html_node/elisp/Key-Binding-Conventions.html

[fn:lnk-beginend] https://github.com/DamienCassou/beginend

[fn:lnk-crux] https://github.com/bbatsov/crux

[fn:lnk-deadgrep] https://github.com/Wilfred/deadgrep

[fn:lnk-dirvish] https://github.com/alexluigit/dirvish

[fn:lnk-gcmh] https://gitlab.com/koral/gcmh

[fn:lnk-hardcore-mode] https://github.com/magnars/hardcore-mode.el

[fn:lnk-latex] https://www.latex-project.org/

[fn:lnk-nixpkgs] https://github.com/NixOS/nixpkgs/

[fn:lnk-no-littering] https://github.com/emacscollective/no-littering

[fn:lnk-pdftools] https://pdftools.wiki/

[fn:lnk-setupel] https://www.emacswiki.org/emacs/SetupEl

[fn:lnk-unfill] https://github.com/purcell/unfill
