home-configs/anderson/emacs/init.el
  (:global [remap list-buffers] bs-show))

(setup display-line-numbers
  (:global (kbd "C-c l l") display-line-numbers-mode))

(setup unfill
  (:global (kbd "C-c u p") unfill-paragraph)
  (:global (kbd "C-c u r") unfill-region)
  (:global (kbd "C-c u t") unfill-toggle))

(setup helpful
  (:require helpful)
  (:global [remap describe-key] helpful-key)
  (:global [remap describe-function] helpful-callable)
  (:global [remap describe-command] helpful-command)
  (:global [remap describe-variable] helpful-variable)
  (:global (kbd "C-c h s") helpful-symbol)
  (:global (kbd "C-c h p") helpful-at-point))

(setup dynamic-ruler
  (:if-package dynamic-ruler)
  ;; (:global (kbd "C-c r v") dynamic-ruler-vertical) ;; bugged!
  (:global (kbd "C-c r h") dynamic-ruler))

(setup (:require dired dired-x diredfl dirvish)
  (:global (kbd "C-c d f") dirvish-fd)
  (:with-map dired-mode-map
    (defun atorres-1985|dired-find-file-other-frame ()
      "In Dired, visit this file or directory in another window."
      (interactive)
      (find-file-other-frame (dired-get-file-for-visit)))
    (:bind (kbd "F") #'atorres-1985|dired-find-file-other-frame))

  (:with-map dirvish-mode-map
    (:bind (kbd "a")   dirvish-quick-access)
    (:bind (kbd "f")   dirvish-file-info-menu)
    (:bind (kbd "y")   dirvish-yank-menu)
    (:bind (kbd "N")   dirvish-narrow)
    (:bind (kbd "^")   dirvish-history-last)
    (:bind (kbd "h")   dirvish-history-jump) ; remapped `describe-mode'
    (:bind (kbd "s")   dirvish-quicksort)    ; remapped `dired-sort-toggle-or-edit'
    ;; (:bind (kbd "v")   dirvish-vc-menu)   ; remapped `dired-view-file'
    (:bind "<tab>" dirvish-subtree-toggle) ;; kbd does not work!
    (:bind (kbd "M-f") dirvish-history-go-forward)
    (:bind (kbd "M-b") dirvish-history-go-backward)
    (:bind (kbd "M-l") dirvish-ls-switches-menu)
    (:bind (kbd "M-m") dirvish-mark-menu)
    (:bind (kbd "M-t") dirvish-layout-toggle)
    (:bind (kbd "M-s") dirvish-setup-menu)
    (:bind (kbd "M-e") dirvish-emerge-menu)
    (:bind (kbd "M-j") dirvish-fd-jump)))

(setup magit
  (:if-package magit)
  (global-unset-key (kbd "C-x g"))
  (:global "C-c g s" magit-status))

(setup dwim-shell-command
  (:if-package dwim-shell-command)
  (:global (kbd "C-c s !") dwim-shell-command))

(setup gcmh
  (:require gcmh)
  (setopt gcmh-verbose nil)
  (gcmh-mode))

(defconst atorres-1985|init-finish-time (current-time)
  "Init finish time.")

(provide 'init)

;; Local Variables:
;; mode: emacs-lisp
;; coding: utf-8-unix
;; fill-column: 80
;; End:

;;; init.el ends here
